### 第2章: UNIXコマンド
> popular-names.txtは，アメリカで生まれた赤ちゃんの「名前」「性別」「人数」「年」をタブ区切り形式で格納したファイルである．以下の処理を行うプログラムを作成し，popular-names.txtを入力ファイルとして実行せよ．さらに，同様の処理をUNIXコマンドでも実行し，プログラムの実行結果を確認せよ．

In [14]:
!rm  ../data/popular-names.txt
!wget https://nlp100.github.io/data/popular-names.txt -P ../data

--2024-10-29 11:45:54--  https://nlp100.github.io/data/popular-names.txt
Resolving nlp100.github.io (nlp100.github.io)... 185.199.109.153, 185.199.110.153, 185.199.111.153, ...
Connecting to nlp100.github.io (nlp100.github.io)|185.199.109.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 55026 (54K) [text/plain]
Saving to: ‘../data/popular-names.txt’

popular-names.txt   100%[===================>]  53.74K  --.-KB/s    in 0.01s

2024-10-29 11:45:55 (5.48 MB/s) - ‘../data/popular-names.txt’ saved [55026/55026]

### 10. 行数のカウント
> 行数をカウントせよ．確認にはwcコマンドを用いよ．

In [15]:
import pandas as pd

path = '../data/popular-names.txt'
df_popular_names = pd.read_csv(path, sep="\t", header=None)

print("行数: ", df_popular_names.shape[0])

行数:  2780

In [16]:
!wc ../data/popular-names.txt

 2780 11120 55026 ../data/popular-names.txt

### 11. タブをスペースに置換
>タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [17]:
with open(path, 'r') as raw_file:
     str_file = raw_file.read()
     str_file = str_file.replace('\t', ' ')

with open('../data/space-separated.txt', 'w') as file:
     file.write(str_file)

In [18]:
!cat ../data/popular-names.txt | tr "\t" " " > ../data/space-separated2.txt
!diff ../data/space-separated.txt ../data/space-separated2.txt

### 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
> 各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [27]:
col1 = df_popular_names[0]
col2 = df_popular_names[1]

col1.to_csv('../data/col1.txt', sep=',', header=False, index=False)
col2.to_csv('../data/col2.txt', sep=',', header=False, index=False)

In [42]:
!cut -f 1 ../data/popular-names.txt > ../data/col1-cut.txt
!cut -f 2 ../data/popular-names.txt > ../data/col2-cut.txt

!diff ../data/col1.txt ../data/col1-cut.txt
!diff ../data/col2.txt ../data/col2-cut.txt

### 13. col1.txtとcol2.txtをマージ
> 12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [46]:
col1col2 = pd.concat([col1, col2], axis=1)
col1col2.to_csv('../data/col1col2.txt', sep='\t', header=False, index=False)

In [48]:
!paste ../data/col1-cut.txt ../data/col2-cut.txt > ../data/col1col2-paste.txt
!diff ../data/col1col2.txt ../data/col1col2-paste.txt

### 14. 先頭からN行を出力
> 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [21]:
n = int(input())
df_popular_names.head(n)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

In [51]:
!head -5 ../data/popular-names.txt

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880

### 15. 末尾のN行を出力
> 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ

In [22]:
n = int(input())
df_popular_names.tail(n)

             0  1      2     3
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

In [52]:
!tail -5 ../data/popular-names.txt

Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

### 16. ファイルをN分割する
> 自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [59]:
total_partitions = int(input())

idx_start = 0
idx_end = df_popular_names.shape[0] // total_partitions
for i in range(total_partitions):
    part = df_popular_names[idx_start:idx_end]
    display(part)
    idx_start = idx_end+1
    idx_end += df_popular_names.shape[0] // total_partitions

             0  1      2     3
0         Mary  F   7065  1880
1         Anna  F   2604  1880
2         Emma  F   2003  1880
3    Elizabeth  F   1939  1880
4       Minnie  F   1746  1880
..         ... ..    ...   ...
921    Dorothy  F  36617  1926
922      Betty  F  32964  1926
923      Helen  F  26884  1926
924   Margaret  F  23070  1926
925       Ruth  F  20223  1926

[926 rows x 4 columns]

                0  1      2     3
927      Virginia  F  16162  1926
928       Mildred  F  13551  1926
929       Frances  F  13355  1926
930        Robert  M  61130  1926
931          John  M  56110  1926
...           ... ..    ...   ...
1847    Stephanie  F  16885  1972
1848      Heather  F  16321  1972
1849       Nicole  F  15752  1972
1850      Michael  M  71405  1972
1851  Christopher  M  52189  1972

[925 rows x 4 columns]

             0  1      2     3
1853     David  M  46366  1972
1854      John  M  43181  1972
1855    Robert  M  43037  1972
1856     Jason  M  37446  1972
1857     Brian  M  36322  1972
...        ... ..    ...   ...
2773     James  M  13525  2018
2774    Oliver  M  13389  2018
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018

[925 rows x 4 columns]

In [ ]:
!split popular

### 17. １列目の文字列の異なり
> 1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ

### 18. 各行を3コラム目の数値の降順にソート
> 各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）.

### 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
> 各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ